serverless-compare-langs/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  processor: "generator.js"
  phases:
    - duration: 300
      arrivalRate: 100

scenarios:
  - name: "Generate products"
    weight: 5
    flow:
      - function: "generateProduct"
      - put:
          url: "/{{ id }}"
          headers:
            Content-Type: "application/json"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            price: "{{ price }}"
      - loop:
         - get:
            url: "/{{ id }}"
        count: 10
      - think: 3
      - delete:
          url: "/{{ id }}"
  - name: "List products and leave"
    weight: 1
    flow:
      - get:
          url: "/"
  - name: "List products and paginate"
    weight: 1
    flow:
      - get:
          url: "/"
          capture:
            json: "$.next"
            as: "next_page"
      - get:
          url: "/{{ next_page }}"
          capture:
            json: "$.next"
            as: "next_page"
      - get:
          url: "/{{ next_page }}"